Since the movie titles csv file contains commas in the names of the movies, pandas sees that as multiple columns. This can be amended by enclosing the third column in quotation marks.

In [1]:
# read in each line of the csv as a row

f = open('data/movie_titles.csv', 'r')
rows = f.read().split('\n')
rows[:5]

f.close()

In [2]:
# split each line by commas, first two elements are individual columns, rest should be the name of the movie
rows_split = [row.split(',', 2) for row in rows]
rows_split[:5]

[['1', '2003', 'Dinosaur Planet'],
 ['2', '2004', 'Isle of Man TT 2004 Review'],
 ['3', '1997', 'Character'],
 ['4', '1994', "Paula Abdul's Get Up & Dance"],
 ['5', '2004', 'The Rise and Fall of ECW']]

In [3]:
import pandas as pd

df = pd.DataFrame(rows_split)
df.head()

   0     1                             2
0  1  2003               Dinosaur Planet
1  2  2004    Isle of Man TT 2004 Review
2  3  1997                     Character
3  4  1994  Paula Abdul's Get Up & Dance
4  5  2004      The Rise and Fall of ECW

In [4]:
# for the final column, we need to tell csv that it is a string, not a collection of elements. So we must
# add a double quote to both sides of the string.

df[2] = [f'"{name}"' for name in df[2]]
df.head()

   0     1                               2
0  1  2003               "Dinosaur Planet"
1  2  2004    "Isle of Man TT 2004 Review"
2  3  1997                     "Character"
3  4  1994  "Paula Abdul's Get Up & Dance"
4  5  2004      "The Rise and Fall of ECW"

In [7]:
# finally, use pandas to write to the output csv file
df.to_csv('data/movie_titles_fixed.csv', index=False, header=False, encoding='ISO-8859-1')